# 10.行数をカウントせよ．確認にはwcコマンドを用いよ．

wc -l popular-names.txt

# 11.タブ1文字につきスペース1文字に置換せよ．確認にはsedコマンド，trコマンド，もしくはexpandコマンドを用いよ．

In [15]:
import pandas as pd
a = pd.read_table("popular-names.txt", sep="\t", header=None)

In [16]:
a.to_csv("p2.txt", sep=" ", index=False, header=None)

expand -> tabを-t後ろの数のスペースで置き換える。デフォルト8

expand -t 1 popular-names.txt

# 12.各行の1列目だけを抜き出したものをcol1.txtに，2列目だけを抜き出したものをcol2.txtとしてファイルに保存せよ．確認にはcutコマンドを用いよ．

In [20]:
a = pd.read_table("popular-names.txt", sep="\t", header=None)

In [23]:
a.iloc[:, 0].to_csv("pandas12-1.txt", index=False, header=None)

In [24]:
a.iloc[:, 1].to_csv("pandas12-2.txt", index=False, header=None)

cat popular-names.txt  | sed 's/[\t ]\+/\t/g' | cut -f2 > po-2col.txt

cat -> 内容表示
sed -> 正規表現により置き換え
cut -> 指定した列を抽出

# 13.12で作ったcol1.txtとcol2.txtを結合し，元のファイルの1列目と2列目をタブ区切りで並べたテキストファイルを作成せよ．確認にはpasteコマンドを用いよ．

In [25]:
a = pd.read_table("pandas12-1.txt", header=None)
b = pd.read_table("pandas12-2.txt", header=None)

In [35]:
c = a.join(b, rsuffix="aa")
c.to_csv("13.txt", index=False, header=None)

paste po-1col.txt po-2col.txt > 13.txt

# 14.自然数Nをコマンドライン引数などの手段で受け取り，入力のうち先頭のN行だけを表示せよ．確認にはheadコマンドを用いよ．

In [36]:
popu = pd.read_table("popular-names.txt", header=None)
n = int(input())

popu.head(n)

10

           0  1     2     3
0       Mary  F  7065  1880
1       Anna  F  2604  1880
2       Emma  F  2003  1880
3  Elizabeth  F  1939  1880
4     Minnie  F  1746  1880
5   Margaret  F  1578  1880
6        Ida  F  1472  1880
7      Alice  F  1414  1880
8     Bertha  F  1320  1880
9      Sarah  F  1288  1880

head -n 3 popular-names.txt

# 15.自然数Nをコマンドライン引数などの手段で受け取り，入力のうち末尾のN行だけを表示せよ．確認にはtailコマンドを用いよ．

In [37]:
n = int(input())

popu.tail(n)

4

           0  1      2     3
2776  Elijah  M  12886  2018
2777   Lucas  M  12585  2018
2778   Mason  M  12435  2018
2779   Logan  M  12352  2018

tail -n 3 popular-names.txt

# 16.自然数Nをコマンドライン引数などの手段で受け取り，入力のファイルを行単位でN分割せよ．同様の処理をsplitコマンドで実現せよ．

In [42]:
-(-1000//3)

334

In [43]:
1000//3

333

In [45]:
n = int(input())
if n <= 1:
    print("2以上の数値を指定してください")
else:
    df = pd.read_table("popular-names.txt", header=None)
    nrow = len(df)//n
    for i in range(n):
        if i == n-1:
            df.iloc[nrow*i:, :].to_csv(f"16/ans_{i}.txt", sep="\t",index=False, header=None)
        else:
            df.iloc[nrow*i:nrow*(i+1), :].to_csv(f"16/ans_{i}.txt", sep="\t",index=False, header=None)

10

split -l 10 popular-names.txt file16

# 17.1列目の文字列の種類（異なる文字列の集合）を求めよ．確認にはcut, sort, uniqコマンドを用いよ．

In [61]:
import collections
df =  pd.read_table("popular-names.txt", header=None)
set(df[0].to_list())

{'Abigail',
 'Aiden',
 'Alexander',
 'Alexis',
 'Alice',
 'Amanda',
 'Amelia',
 'Amy',
 'Andrew',
 'Angela',
 'Anna',
 'Annie',
 'Anthony',
 'Ashley',
 'Austin',
 'Ava',
 'Barbara',
 'Benjamin',
 'Bertha',
 'Bessie',
 'Betty',
 'Brandon',
 'Brian',
 'Brittany',
 'Carol',
 'Carolyn',
 'Charles',
 'Charlotte',
 'Chloe',
 'Christopher',
 'Clara',
 'Crystal',
 'Cynthia',
 'Daniel',
 'David',
 'Deborah',
 'Debra',
 'Donald',
 'Donna',
 'Doris',
 'Dorothy',
 'Edward',
 'Elijah',
 'Elizabeth',
 'Emily',
 'Emma',
 'Ethan',
 'Ethel',
 'Evelyn',
 'Florence',
 'Frances',
 'Frank',
 'Gary',
 'George',
 'Hannah',
 'Harper',
 'Harry',
 'Heather',
 'Helen',
 'Henry',
 'Ida',
 'Isabella',
 'Jacob',
 'James',
 'Jason',
 'Jayden',
 'Jeffrey',
 'Jennifer',
 'Jessica',
 'Joan',
 'John',
 'Joseph',
 'Joshua',
 'Judith',
 'Julie',
 'Justin',
 'Karen',
 'Kathleen',
 'Kelly',
 'Kimberly',
 'Larry',
 'Laura',
 'Lauren',
 'Liam',
 'Lillian',
 'Linda',
 'Lisa',
 'Logan',
 'Lori',
 'Lucas',
 'Madison',
 'Margaret',
 'Marie',
 'Mark',
 'Mary',
 'Mason',
 'Matthew',
 'Megan',
 'Melissa',
 'Mia',
 'Michael',
 'Michelle',
 'Mildred',
 'Minnie',
 'Nancy',
 'Nicholas',
 'Nicole',
 'Noah',
 'Oliver',
 'Olivia',
 'Pamela',
 'Patricia',
 'Rachel',
 'Rebecca',
 'Richard',
 'Robert',
 'Ronald',
 'Ruth',
 'Samantha',
 'Sandra',
 'Sarah',
 'Scott',
 'Sharon',
 'Shirley',
 'Sophia',
 'Stephanie',
 'Steven',
 'Susan',
 'Tammy',
 'Taylor',
 'Thomas',
 'Tracy',
 'Tyler',
 'Virginia',
 'Walter',
 'William'}

sort 12-1.txt | uniq -c

uniqでは離れた行の重複は認識できないので、あらかじめソートする

# 18.各行を3コラム目の数値の逆順で整列せよ（注意: 各行の内容は変更せずに並び替えよ）．確認にはsortコマンドを用いよ（この問題はコマンドで実行した時の結果と合わなくてもよい）．

In [57]:
df =  pd.read_table("popular-names.txt", header=None)
df.head()

           0  1     2     3
0       Mary  F  7065  1880
1       Anna  F  2604  1880
2       Emma  F  2003  1880
3  Elizabeth  F  1939  1880
4     Minnie  F  1746  1880

In [58]:
df.sort_values(2)

            0  1      2     3
9       Sarah  F   1288  1880
29      Alice  F   1308  1881
8      Bertha  F   1320  1880
28     Bertha  F   1324  1881
27      Annie  F   1326  1881
...       ... ..    ...   ...
1351   Robert  M  91640  1947
1550  Michael  M  92704  1957
1350    James  M  94757  1947
1360    Linda  F  96211  1948
1340    Linda  F  99689  1947

[2780 rows x 4 columns]

sort -k 3 -t ' ' 11.txt

# 19.各行の1列目の文字列の出現頻度を求め，その高い順に並べて表示せよ．確認にはcut, uniq, sortコマンドを用いよ．

In [59]:
import collections
df =  pd.read_table("popular-names.txt", header=None)
print(collections.Counter(df[0].to_list()))

Counter({'James': 118, 'William': 111, 'John': 108, 'Robert': 108, 'Mary': 92, 'Charles': 75, 'Michael': 74, 'Elizabeth': 73, 'Joseph': 70, 'Margaret': 60, 'George': 58, 'Thomas': 58, 'David': 57, 'Richard': 51, 'Helen': 45, 'Frank': 43, 'Christopher': 43, 'Anna': 41, 'Edward': 40, 'Ruth': 39, 'Patricia': 38, 'Matthew': 37, 'Dorothy': 36, 'Emma': 35, 'Barbara': 32, 'Daniel': 31, 'Joshua': 31, 'Sarah': 26, 'Linda': 26, 'Jennifer': 26, 'Emily': 26, 'Jessica': 25, 'Jacob': 25, 'Mildred': 24, 'Betty': 24, 'Susan': 24, 'Henry': 23, 'Ashley': 23, 'Nancy': 22, 'Andrew': 21, 'Florence': 20, 'Marie': 20, 'Donald': 20, 'Amanda': 20, 'Samantha': 19, 'Karen': 18, 'Lisa': 18, 'Melissa': 18, 'Madison': 18, 'Olivia': 18, 'Stephanie': 17, 'Abigail': 17, 'Ethel': 16, 'Sandra': 16, 'Mark': 16, 'Frances': 15, 'Carol': 15, 'Angela': 15, 'Michelle': 15, 'Heather': 15, 'Ethan': 15, 'Isabella': 15, 'Shirley': 14, 'Kimberly': 14, 'Amy': 14, 'Ava': 14, 'Virginia': 13, 'Deborah': 13, 'Brian': 13, 'Jason': 13, 'Nicole': 13, 'Hannah': 13, 'Sophia': 13, 'Minnie': 12, 'Bertha': 12, 'Donna': 12, 'Cynthia': 11, 'Alice': 10, 'Doris': 10, 'Ronald': 10, 'Brittany': 10, 'Nicholas': 10, 'Mia': 10, 'Noah': 10, 'Joan': 9, 'Debra': 9, 'Tyler': 9, 'Ida': 8, 'Clara': 8, 'Judith': 8, 'Taylor': 8, 'Alexis': 8, 'Alexander': 8, 'Mason': 8, 'Harry': 7, 'Sharon': 7, 'Steven': 7, 'Tammy': 7, 'Brandon': 7, 'Liam': 7, 'Anthony': 6, 'Annie': 5, 'Gary': 5, 'Jeffrey': 5, 'Jayden': 5, 'Charlotte': 5, 'Lillian': 4, 'Kathleen': 4, 'Justin': 4, 'Austin': 4, 'Chloe': 4, 'Benjamin': 4, 'Evelyn': 3, 'Megan': 3, 'Aiden': 3, 'Harper': 3, 'Elijah': 3, 'Bessie': 2, 'Larry': 2, 'Rebecca': 2, 'Lauren': 2, 'Amelia': 2, 'Logan': 2, 'Oliver': 2, 'Walter': 1, 'Carolyn': 1, 'Pamela': 1, 'Lori': 1, 'Laura': 1, 'Tracy': 1, 'Julie': 1, 'Scott': 1, 'Kelly': 1, 'Crystal': 1, 'Rachel': 1, 'Lucas': 1})